title: msedgewebview2.exe Use As Proxy
id: b772b0f4-79ff-40d6-b379-93caf5a8d183
status: experimental
description: "Detect instances where 'msedgewebview2.exe' is executed with commandline '--gpu-launcher', '--utility-cmd-prefix', '--renderer-cmd-prefix', or '--browser-subprocess-path' "
references:
    - https://lolbas-project.github.io/lolbas/Binaries/msedgewebview2/
author: Nischal Khadgi
date: 2023/08/29
tags:
    - attack.defense_evasion
    - attack.t1202
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
       - Image|endswith: '\msedgewebview2.exe'
       - OriginalFileName: 'msedgewebview2.exe'
    selection_cmd:
        CommandLine|contains: 
                        - '--gpu-launcher'
                        - '--utility-cmd-prefix'
                        - '--renderer-cmd-prefix'
                        -  '--browser-subprocess-path'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
